#+TITLE: Big Finish Main Range top 150

#+BEGIN_QUOTE
Tip: bookmarklet for sort table columns: https://www.squarefree.com/bookmarklets/pagedata.html

#+BEGIN_EXPORT html
** 4DA

|   | 2021.07 | Prio. | 2020.07 |    # | Title                            | Author                         | Featuring                                | Released          |
|   |         |       |         |      |                                  |                                | <40>                                     |                   |
|---+---------+-------+---------+------+----------------------------------+--------------------------------+------------------------------------------+-------------------|
|   |     6.3 | [#E]  |         |  1.1 | Destination: Nerva               | Nicholas Briggs                | Leela                                    | 9 January 2012    |
|   |     7.5 | [#C]  |         |  1.2 | The Renaissance Man              | Justin Richards                | Leela                                    | February 2012     |
| / |     8.4 | [#B]  |         |  1.3 | The Wrath of the Iceni           | John Dorney                    | Leela                                    | March 2012        |
|   |     6.6 | [#E]  |         |  1.4 | Energy of the Daleks             | Nicholas Briggs                | Leela, Daleks                            | April 2012        |
|   |     7.3 | [#D]  |         |  1.5 | Trail of the White Worm /        | Alan Barnes                    | Leela, The Master                        | May 2012          |
|   |     7.2 | [#D]  |         |  1.6 | The Oseidon Adventure            | Alan Barnes                    | Leela, The Master, Kraals                | June 2012         |
| / |     8.2 | [#B]  |         |  2.1 | The Auntie Matter                | Jonathan Morris                | Romana I                                 | 14 January 2013   |
|   |     6.8 | [#E]  |         |  2.2 | The Sands of Life /              | Nicholas Briggs                | Romana I, K9 Mark II, Cuthbert, Laan     | 11 February 2013  |
|   |     6.3 | [#E]  |         |  2.3 | War Against the Laan             | Nicholas Briggs                | Romana I, Cuthbert, Laan                 | 11 March 2013     |
| ^ |     8.1 | [#B]  |         |  2.4 | The Justice of Jalxar            | John Dorney                    | Romana I, Jago, Litefoot                 | March 2013        |
| ^ |     7.6 | [#C]  |         |  2.5 | Phantoms of the Deep             | Jonathan Morris                | Romana I, K9 Mark II                     | May 2013          |
|   |     7.0 | [#D]  |         |  2.6 | The Dalek Contract /             | Nicholas Briggs                | Romana I, K9 Mark II, Daleks, Cuthbert   | June 2013         |
|   |     7.0 | [#D]  |         |  2.7 | The Final Phase                  | Nicholas Briggs                | Romana I, K9 Mark II, Daleks, Cuthbert   | July 2013         |
| / |     7.7 | [#C]  |         |  3.1 | The King of Sontar               | John Dorney                    | Leela, Sontarans                         | 15 January 2014   |
|   |     7.4 | [#D]  |         |  3.2 | White Ghosts                     | Alan Barnes                    | Leela                                    | 14 February 2014  |
| / |     8.2 | [#B]  |         |  3.3 | The Crooked Man                  | John Dorney                    | Leela                                    | 14 March 2014     |
|   |     6.2 | [#E]  |         |  3.4 | The Evil One                     | Nicholas Briggs                | Leela, The Master                        | 11 April 2014     |
| / |     7.8 | [#C]  |         |  3.5 | Last of the Colophon             | Jonathan Morris                | Leela                                    | 14 May 2014       |
|   |     6.9 | [#E]  |         |  3.6 | Destroy the Infinite             | Nicholas Briggs                | Leela, The Eminence                      | 18 June 2014      |
|   |     6.3 | [#E]  |         |  3.7 | The Abandoned                    | Louise Jameson and Nigel Fairs | Leela                                    | 11 July 2014      |
|   |     7.0 | [#D]  |         |  3.8 | Zygon Hunt                       | Nicholas Briggs                | Leela, Zygons                            | 15 August 2014    |
|   |     6.5 | [#E]  |         |  4.1 | The Exxilons                     | Nicholas Briggs                | Leela, K9 Mark I, Exxilons               | 15 January 2015   |
|   |     7.5 | [#C]  |         |  4.2 | The Darkness of Glass            | Justin Richards                | Leela                                    | 12 February 2015  |
| ^ |     8.4 | [#B]  |         |  4.3 | Requiem for the Rocket Men       | John Dorney                    | Leela, K9 Mark I, Rocket Men, The Master | 13 March 2015     |
|   |     7.3 | [#D]  |         |  4.4 | Death Match                      | Matt Fitton                    | Leela, K9 Mark I, The Master             | 16 April 2015     |
| ^ |     7.7 | [#C]  |         |  4.5 | Suburban Hell                    | Alan Barnes                    | Leela                                    | 21 May 2015       |
|   |     7.4 | [#D]  |         |  4.6 | The Cloisters of Terror          | Jonathan Morris                | Leela, Emily Shaw                        | 4 June 2015       |
|   |     7.2 | [#D]  |         |  4.7 | The Fate of Krelos /             | Nicholas Briggs                | Leela, K9 Mark I                         | 8 July 2015       |
|   |     6.0 | [#E]  |     5.8 |  4.8 | Return to Telos                  | Nicholas Briggs                | Leela, K9 Mark I, Jamie, Cybermen        | 11 August 2015    |
|   |     7.1 | [#D]  |         |  5.1 | Wave of Destruction              | Justin Richards                | Romana II, K9 Mark II, Vardans           | 12 January 2016   |
|   |     7.1 | [#D]  |         |  5.2 | The Labyrinth of Buda Castle     | Eddie Robson                   | Romana II                                | 18 February 2016  |
| ^ |     7.6 | [#C]  |         |  5.3 | The Paradox Planet /             | Jonathan Morris                | Ronama II, K9 Mark II                    | 16 March 2016     |
| ^ |     7.6 | [#C]  |         |  5.4 | Legacy of Death                  | Jonathan Morris                | Ronama II, K9 Mark II                    | 13 April 2016     |
|   |     7.2 | [#D]  |         |  5.5 | Gallery of Ghouls                | Alan Barnes                    | Romana II                                | 10 May 2016       |
| / |     8.7 | [#A]  |         |  5.6 | The Trouble with Drax            | John Dorney                    | Romana II, K9 Mark II, Drax              | 14 June 2016      |
|   |     7.4 | [#D]  |         |  5.7 | The Pursuit of History /         | Nicholas Briggs                | Roaman II, K9 Mark II, Black Guardian, White Guardian, Cuthbert, Laan | 13 July 2016      |
|   |     7.3 | [#D]  |         |  5.8 | Casualties of Time               | Nicholas Briggs                | Roaman II, K9 Mark II, Black Guardian, White Guardian, Cuthbert, Laan | 10 August 2016    |
|   |     6.8 | [#E]  |         |  6.1 | The Beast of Kravenos            | Justin Richards                | Romana II, K9 Mark II, Jago, Litefoot    | 11 January 2017   |
|   |     7.3 | [#D]  |         |  6.2 | The Eternal Battle               | Cavan Scott, Mark Wright       | Romana II, K9 Mark II, Sontarans         | 15 February 2017  |
|   |     6.3 | [#E]  |         |  6.3 | The Silent Scream                | James Goss                     | Romana II, K9 Mark II                    | 22 March 2017     |
|   |     6.7 | [#E]  |         |  6.4 | Dethras                          | Adrian Poynton                 | Romana II                                | 20 April 2017     |
|   |     7.4 | [#D]  |         |  6.5 | The Haunting of Malkin Place     | Phil Mulryne                   | Romana II                                | 17 May 2017       |
|   |     7.0 | [#D]  |         |  6.6 | Subterranea                      | Jonathan Morris                | Romana II                                | 14 June 2017      |
|   |     6.6 | [#E]  |         |  6.7 | The Movellan Grave               | Andrew Smith                   | Romana II, Movellans                     | 12 July 2017      |
|   |     7.4 | [#D]  |     7.2 |  6.8 | The Skin of the Sleek /          | Marc Platt                     | Romana II                                | 16 August 2017    |
|   |     7.1 | [#D]  |         |  6.9 | The Thief Who Stole Time         | Marc Platt                     | Romana II                                | 13 September 2017 |
| ^ |     7.7 | [#C]  |         |  7.1 | The Sons of Kaldor               | Andrew Smith                   | Leela, Kaldor androids                   | 18 January 2018   |
|   |     7.5 | [#C]  |         |  7.2 | The Crowmarsh Experiment         | David Llewellyn                | Leela                                    | 18 January 2018   |
|   |     7.4 | [#D]  |         |  7.3 | The Mind Runners /               | John Dorney                    | K9 Mark I                                | 18 January 2018   |
|   |     7.4 | [#D]  |         |  7.4 | The Demon Rises                  | John Dorney                    | K9 Mark I                                | 18 January 2018   |
|   |     7.0 | [#D]  |         |  7.5 | The Shadow of London             | Justin Richards                | Leela                                    | 16 May 2018       |
|   |     7.2 | [#D]  |     7.5 |  7.6 | The Bad Penny                    | Dan Starkey                    | Leela                                    | 16 May 2018       |
| ^ |     7.8 | [#C]  |         |  7.7 | Kill the Doctor! /               | Guy Adams                      | Leela, Sutekh                            | 16 May 2018       |
|   |     7.0 | [#D]  |         |  7.8 | The Age of Sutekh                | Guy Adams                      | Leela, Sutekh                            | 16 May 2018       |
|   |     6.8 | [#E]  |         |  8.1 | The Sinestran Kill               | Andrew Smith                   | Ann                                      | 16 January 2019   |
|   |     6.7 | [#E]  |     6.9 |  8.2 | Planet of the Drashigs           | Phil Mulryne                   | Ann, K9 Mark II, Drashigs                | 16 January 2019   |
| ^ |     7.7 | [#C]  |     7.9 |  8.3 | The Enchantress of Numbers       | Simon Barnard, Paul Morris     | Ann, Ada Lovelace                        | 16 January 2019   |
|   |     7.2 | [#D]  |         |  8.4 | The False Guardian /             | Guy Adams                      | Ann, K9 Mark II, Zephon, Varga plants    | 16 January 2019   |
|   |     6.8 | [#E]  |         |  8.5 | Time's Assassin                  | Guy Adams                      | Ann, K9 Mark II, Zephon, Varga plants    | 13 February 2019  |
|   |     7.3 | [#D]  |         |  8.6 | Fever Island                     | Jonathan Barnes                | Ann                                      | 13 February 2019  |
| ^ |     8.2 | [#B]  |         |  8.7 | The Perfect Prisoners /          | John Dorney                    | Ann, K9 Mark II, Malpha, Sentreal, Trantis, Beaus, Celation, Gearon | 13 February 2019  |
| ^ |     8.3 | [#B]  |         |  8.8 | The Perfect Prisoners (part 2)   | John Dorney                    | Ann, K9 Mark II, Malpha, Sentreal, Trantis, Beaus, Celation, Gearon | 13 February 2019  |
| / |     8.2 | [#B]  |     8.6 | 9SP1 | Shadow of the Sun                | Robert Valentine               | Leela, K9 Mark I                         | 12 May 2020       |
| ^ |     7.7 | [#C]  |         |  9.1 | Purgatory 12                     | Marc Platt                     | Romana II, Adric, K9 Mark II             | 22 January 2020   |
| ? |     8.3 | [#B]  |         |  9.2 | Chase the Night                  | Jonathan Morris                | Romana II, Adric, K9 Mark II             | 22 January 2020   |
|   |     7.2 | [#D]  |     7.5 |  9.3 | The Planet of Witches            | Alan Barnes                    | Romana II, Adric, K9 Mark II             | 12 February 2020  |
| ^ |     8.0 | [#B]  |     8.4 |  9.4 | The Quest of the Engineer        | Andrew Smith                   | Romana II, Adric, K9 Mark II             | 12 February 2020  |
| ^ |     7.6 | [#C]  |         | 10.1 | The World Traders                | Guy Adams                      | Leela, Usurians                          | 20 January 2021   |
| ^ |     7.8 | [#C]  |         | 10.2 | The Day of the Comet             | Jonathan Morris                | Leela                                    | 20 January 2021   |
| ^ |     7.8 | [#C]  |         | 10.3 | The Tribulations of Tahdeus Nook | Andrew Smith                   | Leela                                    | 10 February 2021  |
|   |     6.1 | [#E]  |         | 10.4 | The Primeval Design              | Helen Goldwyn                  | Leela, Mary Annin                        |                   |
#+TBLFM: $3='(cond ((>= $2 8.5) "[#A]") ((>= $2 8.0) "[#B]") ((>= $2 7.5) "[#C]") ((>= $2 7.0) "[#D]") (t "[#E]"));N
** 8DA

|   |      |         # | Title                          | 2021.04 | Featuring                                       |   |
|---+------+-----------+--------------------------------+---------+-------------------------------------------------+---|
| # | [#C] | 1.1 / 1.2 | Blood of the Daleks            |     7.8 | Lucie, Daleks                                   |   |
|   | [#C] |       1.3 | Horror of Glam Rock            |     7.5 | Lucie, Pat                                      |   |
| / | [#D] |       1.4 | +Immortal Beloved+             |     7.3 | Lucie                                           |   |
|   | [#E] |       1.5 | Phobos                         |     6.5 | Lucie                                           |   |
|   | [#D] |       1.6 | No More Lies                   |     7.1 | Lucie                                           |   |
| ^ | [#A] |       1.7 | Human Resources /              |     8.7 | Lucie, Cybermen, the Headhunter, Karen, Straxus |   |
| ^ | [#B] |       1.8 | Human Resources                |     8.3 |                                                 |   |
|---+------+-----------+--------------------------------+---------+-------------------------------------------------+---|
|   | [#E] |   FALM1.1 | The Dalek Trap                 |     6.6 | Lucie, Daleks                                   |   |
|   | [#E] |   FALM1.2 | The Revolution Game            |     6.8 | Lucie                                           |   |
|   | [#C] |   FALM1.3 | The House on the Edge of Chaos |     7.6 |                                                 |   |
| ? | [#B] |   FALM1.4 | Island of the Fendahl          |     8.1 | Lucie, Fendahl                                  |   |
|---+------+-----------+--------------------------------+---------+-------------------------------------------------+---|
|   | [#E] |       2.1 | Dead London                    |     6.5 | Lucie                                           |   |
|   | [#C] |       2.2 | Max Warp                       |     7.5 |                                                 |   |
| # | [#C] |       2.3 | Brave New Town                 |     7.9 | Lucie, Nestene                                  |   |
|   | [#E] |       2.4 | The Skull of Sobek             |     5.5 | Lucie                                           |   |
| # | [#C] |       2.5 | Grand Theft Cosmos             |     7.9 | Lucie, the Headhunter, Karen                    |   |
| # | [#C] |       2.6 | +The Zygon Who Fell to Earth+  |     7.9 | Lucie, Pat, Zygons                              |   |
|   | [#C] |       2.7 | Sisters of the Flame           |     7.7 | Lucie, Morbius, Sisterhood of Karn, Straxus     |   |
|   | [#D] |       2.8 | The Vengeance of Morbius       |     7.1 | Lucie, Morbius, Sisterhood of Karn, Straxus     |   |
|---+------+-----------+--------------------------------+---------+-------------------------------------------------+---|
|   | [#D] |       3.1 | Orbis                          |     7.1 | Lucie, the Headhunter                           |   |
|   | [#E] |       3.2 | Hothouse                       |     6.8 | Lucie, Krynoids                                 |   |
|   | [#C] |       3.3 | The Beast of Orlok             |     7.5 | Lucie                                           |   |
|   | [#D] |       3.4 | Wirrn Dawn                     |     7.1 | Lucie, Wirrn                                    |   |
|   | [#D] |       3.5 | The Scapegoat                  |     7.2 | Lucie                                           |   |
|   | [#C] |       3.6 | The Cannibalists               |     7.5 | Lucie                                           |   |
|   | [#C] |       3.7 | The Eight Truths               |     7.7 | Lucie, Karen, Eight Legs                        |   |
|   | [#C] |       3.8 | Worldwide Web                  |     7.5 | Lucie, Karen, Eight Legs                        |   |
|---+------+-----------+--------------------------------+---------+-------------------------------------------------+---|
| ^ | [#B] |       4.1 | +Death in Blackpool+           |     8.4 | Lucie, Pat, Zygons                              |   |
|   | [#A] |      4.10 | +To the Death+                 |     9.1 | Daleks, Lucie, Susan, Alex, the Monk, Tamsin    |   |
|   | [#C] |       4.2 | Situation Vacant               |     7.6 | Tamsin                                          |   |
|   | [#E] |       4.3 | Nevermore                      |     6.6 | Tamsin                                          |   |
| / | [#B] |       4.4 | +The Book of Kells+            |     8.1 | Tamsin, the Monk, Lucie                         |   |
| / | [#C] |       4.5 | +[[https://tardis.fandom.com/wiki/Deimos_(audio_story)][Deimos]]+                       |     7.8 | Tamsin, Ice Warriors                            |   |
| / | [#B] |       4.6 | +[[https://tardis.fandom.com/wiki/The_Resurrection_of_Mars_(audio_story)][The Resurrection of Mars]]+     |     8.2 | Tamsin, Lucie, Ice Warriors, the Monk           |   |
|   | [#C] |       4.7 | Relative Dimensions            |     7.6 | Susan, Alex, Lucie                              |   |
|   | [#D] |       4.8 | Prisoner of the Sun            |     7.3 | Susan, Alex, Lucie                              |   |
|   | [#C] |      VIII | An Earthly Child               |     7.5 | Susan, Alex                                     |   |
|   | [#A] |       4.9 | +Lucie Miller+                 |     8.9 | Daleks, Lucie, Susan, Alex, the Monk, Tamsin    |   |
#+TBLFM: $2='(cond ((>= $5 8.5) "[#A]") ((>= $5 8.0) "[#B]") ((>= $5 7.5) "[#C]") ((>= $5 7.0) "[#D]") (t "[#E]"));N

